Охотники_и_рыболовы/src/Documents/РазрешениеНаОхоту/РазрешениеНаОхоту.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РазрешениеНаОхоту</name>
  <basedOn>Catalog.Охотники</basedOn>
  <registerRecords>AccumulationRegister.ДобытаяДичь</registerRecords>
  <registerRecords>AccumulationRegister.КвотыОхотхозяйства</registerRecords>
  <registerRecords>AccumulationRegister.ВыдачаРазрешений</registerRecords>
  <attributes>
    <name>СезонОхоты</name>
    <type>
      <types>CatalogRef.СезоныОхоты</types>
    </type>
  </attributes>
  <attributes>
    <name>Охотхозяйство</name>
    <type>
      <types>CatalogRef.Охотхозяйства</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоОхоты</name>
    <type>
      <types>CatalogRef.Охотхозяйства</types>
    </type>
  </attributes>
  <attributes>
    <name>Охотник</name>
    <type>
      <types>CatalogRef.Охотники</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СерияРазрешения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерРазрешения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>7</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидДичи</name>
    <type>
      <types>CatalogRef.ВидыДичи</types>
    </type>
  </attributes>
  <attributes>
    <name>Сезонная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сдан</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Обработан</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизвольныйПериод</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутевкаДоговор</name>
    <type>
      <types>DocumentRef.ПутевкаДоговор</types>
    </type>
  </attributes>
  <attributes>
    <name>БезПроверки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АктМПР</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Заявление</name>
    <type>
      <types>DocumentRef.Заявление</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДобытаяДичь</name>
    <attributes>
      <name>Дичь</name>
      <type>
        <types>CatalogRef.Дичь</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДобычи</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Охотники_и_рыболовы/src/InformationRegisters/ЦеныПоВидамДичи/ЦеныПоВидамДичи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныПоВидамДичи</name>
  <informationRegisterPeriodicity>Year</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ЦенаСвоимРазовая</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЦенаСвоимСезонная</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЦенаЧужимРазовая</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЦенаЧужимСезонная</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТолькоГосБилетРазовая</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТолькоГосБилетСезонная</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЦенаШтатнымСотрудникам</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЦенаВетеранамВойны</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЦенаИнвалидамПервойГруппы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЦенаПослеВозрастногоПорога</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТолькоСезонная</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДействиеОсобыхЦен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>КлючСвязи</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <dimensions>
    <name>СезонОхоты</name>
    <type>
      <types>CatalogRef.СезоныОхоты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидДичи</name>
    <type>
      <types>CatalogRef.ВидыДичи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Охотники_и_рыболовы/src/Documents/ПутевкаДоговор/ПутевкаДоговор.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПутевкаДоговор</name>
  <basedOn>Document.РазрешениеНаОхоту</basedOn>
  <registerRecords>AccumulationRegister.ПродажаПутевок</registerRecords>
  <attributes>
    <name>СезонОхоты</name>
    <type>
      <types>CatalogRef.СезоныОхоты</types>
    </type>
  </attributes>
  <attributes>
    <name>Охотхозяйство</name>
    <type>
      <types>CatalogRef.Охотхозяйства</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоОхоты</name>
    <type>
      <types>CatalogRef.Охотхозяйства</types>
    </type>
  </attributes>
  <attributes>
    <name>Охотник</name>
    <type>
      <types>CatalogRef.Охотники</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.РазрешениеНаОхоту</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДичи</name>
    <type>
      <types>CatalogRef.ВидыДичи</types>
    </type>
  </attributes>
  <attributes>
    <name>СерияРазрешения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерРазрешения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>7</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сезонная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Стоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СерияПутевки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПутевки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>7</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроизвольныйПериод</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Document>

Охотники_и_рыболовы/src/Documents/Заявление/Заявление.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Заявление</name>
  <basedOn>Document.РазрешениеНаОхоту</basedOn>
  <attributes>
    <name>СезонОхоты</name>
    <type>
      <types>CatalogRef.СезоныОхоты</types>
    </type>
  </attributes>
  <attributes>
    <name>Охотхозяйство</name>
    <type>
      <types>CatalogRef.Охотхозяйства</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоОхоты</name>
    <type>
      <types>CatalogRef.Охотхозяйства</types>
    </type>
  </attributes>
  <attributes>
    <name>Охотник</name>
    <type>
      <types>CatalogRef.Охотники</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.РазрешениеНаОхоту</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДичи</name>
    <type>
      <types>CatalogRef.ВидыДичи</types>
    </type>
  </attributes>
  <attributes>
    <name>Сезонная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроизвольныйПериод</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Руководитель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Document>

Охотники_и_рыболовы/src/Catalogs/Охотники/Охотники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Охотники</name>
  <attributes>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЧленОООР</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Инвалид1Группы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВетеранВОВ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ШтатныйСотрудник</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Охотхозяйство</name>
    <type>
      <types>CatalogRef.Охотхозяйства</types>
    </type>
  </attributes>
  <attributes>
    <name>СерияГосБилета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерГосБилета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>7</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерТелефона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЧленККОООР</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Исключен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

Охотники_и_рыболовы/src/ChartsOfCharacteristicTypes/НастройкиПользователей/НастройкиПользователей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>НастройкиПользователей</name>
  <type>
    <types>CatalogRef.Охотхозяйства</types>
    <types>Boolean</types>
    <types>String</types>
    <types>Date</types>
    <types>Number</types>
    <types>CatalogRef.Пользователи</types>
    <numberQualifiers>
      <precision>10</precision>
    </numberQualifiers>
    <stringQualifiers>
      <length>10</length>
    </stringQualifiers>
    <dateQualifiers>
      <dateFractions>Date</dateFractions>
    </dateQualifiers>
  </type>
  <predefined>
    <items>
      <name>ОсновнаяОрганизация</name>
      <description>Основная организация</description>
      <code>000000001</code>
      <type>
        <types>CatalogRef.Охотхозяйства</types>
      </type>
    </items>
    <items>
      <name>ОсновнойОтветственный</name>
      <description>Основной ответственный</description>
      <code>000000002</code>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </items>
  </predefined>
</mdclass:ChartOfCharacteristicTypes>

Охотники_и_рыболовы/src/Documents/РазрешениеНаОхоту/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.ЗначениеКопирования.Пустая() Тогда
	
		
		
		ТекущийСезон = ОхотаСерверПовтИсп.ПолучитьТекущийСезон();
		
		Если ТекущийСезон.Пустая() Тогда
			ТекстСообщения = "Сезон охоты не открыт";
			Поле = "Объект.СезонОхоты";
			ОхотаСервер.ПоказатьСообщение(ТекстСообщения,Поле);
			Отказ = Истина;
			Возврат;
		ИначеЕсли Объект.СезонОхоты.Пустая() Тогда
			Объект.СезонОхоты = ТекущийСезон;
		КонецЕсли;
		
		ОснОтветственный = ПредопределенноеЗначение("ПланВидовХарактеристик.НастройкиПользователей.ОсновнойОтветственный");
		
		Если Объект.Ответственный.Пустая() Тогда
			Объект.Ответственный = ОхотаСерверПовтИсп.ПолучитьНастройкуПользователя(ОснОтветственный);	
		КонецЕсли;	
		
		Если РольДоступна("ПолныеПрава") Тогда
			Элементы.Охотхозяйство.ТолькоПросмотр = Ложь;
		КонецЕсли;
		
		
		Если Объект.Ссылка.Пустая() Тогда
			Объект.Сезонная = Истина;
			ОснОрганизация = ПредопределенноеЗначение("ПланВидовХарактеристик.НастройкиПользователей.ОсновнаяОрганизация");
			Объект.Охотхозяйство = ОхотаСерверПовтИсп.ПолучитьНастройкуПользователя(ОснОрганизация);
			Объект.МестоОхоты = Объект.Охотхозяйство;
		Иначе
			Если Объект.ПутевкаДоговор.Пустая() Тогда
				Путевка = ОхотаСервер.НайтиПодчиненнуюПутевку(Объект.Ссылка);
			 	Если НЕ Путевка.Пустая() Тогда
					Объект.ПутевкаДоговор = Путевка;
					Попытка
						Записать();
					Исключение
						Отказ = Истина;
					КонецПопытки;	
				КонецЕсли;                                    
			КонецЕсли;	
			СписокДичи = ПолучитьСписокДичи(Объект.ВидДичи);
		КонецЕсли;
	
	Иначе
		Объект.Обработан = Ложь;
		Объект.СерияРазрешения = "";
		Объект.НомерРазрешения = "";
		Объект.ПутевкаДоговор = Документы.ПутевкаДоговор.ПустаяСсылка();
	КонецЕсли;	
	
	ПолучитьПериодыОхоты(Истина);
	
	РаспечатанаЛицеваяСторона = Объект.Обработан;
	РаспечатанаОбратнаяСторона = Объект.Обработан;
	
	ПараметрыВыбораПоСубъектуРФ = ОхотаСерверПовтИсп.ПолучитьПараметрыВыбораПоСубъектуРФ ();
	Элементы.МестоОхоты.ПараметрыВыбора = ПараметрыВыбораПоСубъектуРФ;                                         
	Элементы.Охотхозяйство.ПараметрыВыбора = ПараметрыВыбораПоСубъектуРФ;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПутевку(Ссылка)
	Возврат ОхотаСервер.НайтиПодчиненнуюПутевку(Ссылка);	
КонецФункции

&НаКлиенте
Процедура Декорация1Нажатие(Элемент)
	
	Путевка = Объект.ПутевкаДоговор;
	
	Если (Объект.ПометкаУдаления) И Не ЗначениеЗаполнено(Путевка) Тогда
		ПоказатьПредупреждение(,"Путевку нельзя вводить на основании документа, помеченного на удаление",60);
		Возврат;
	КонецЕсли;
	
	ОткрытьФормуПутевки(Путевка);
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьВопросНаФорме(ТекстВопроса,Путевка) Экспорт
	Оповещение = Новый ОписаниеОповещения("ПроверкаПроведенияЗавершение",ЭтаФорма,Путевка);					
	ПоказатьВопрос(Оповещение,ТекстВопроса,РежимДиалогаВопрос.ДаНет,60);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуПутевки(Путевка)
	
	Если НЕ Объект.Проведен ИЛИ Модифицированность Тогда
		ПроверкаПроведенияИМодифицированности(Путевка);
		Возврат;
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(Путевка) Тогда
		ПараметрыФормы = Новый Структура("Ключ",Путевка);
	Иначе
		ПараметрыФормы = Новый Структура("Основание",Объект.Ссылка);
	КонецЕсли;
	
	Если  ТипЗнч(ВладелецФормы) = Тип("УправляемаяФорма") Тогда
		Если СтрНайти(ВладелецФормы.ИмяФормы,"Документ.ПутевкаДоговор") <> 0 Тогда
			Если ВладелецФормы.Объект.Ссылка = Путевка Тогда
				ВладелецФормы.Активизировать();
			КонецЕсли;	
		Иначе
			ОткрытьФорму("Документ.ПутевкаДоговор.ФормаОбъекта", ПараметрыФормы,ЭтаФорма,УникальныйИдентификатор);	
		КонецЕсли;	
	Иначе
		ОткрытьФорму("Документ.ПутевкаДоговор.ФормаОбъекта", ПараметрыФормы,ЭтаФорма,УникальныйИдентификатор);
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаПроведенияЗавершение(РезультатВопроса,Путевка) Экспорт
	Если РезультатВопроса <> КодВозвратаДиалога.Да Тогда
		Возврат;						
	КонецЕсли;						
	
	Попытка
		ПараметрыЗаписи = Новый Структура("РежимЗаписи,Путевка",РежимЗаписиДокумента.Проведение,Путевка);
		ЭтаФорма.Записать(ПараметрыЗаписи);
	Исключение
		Текст = "Документ не удалось провести."; 
		СообщитьОбОшибкеНаСервере(Текст);
		Возврат;
	КонецПопытки;
	
	Путевка = ПараметрыЗаписи.Путевка;
	
	Если НЕ Путевка.Пустая() Тогда
		ОбновитьДанныеВПодчиненномДокументе(,Путевка);
	КонецЕсли;
	
	ОткрытьФормуПутевки(Путевка);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СообщитьОбОшибкеНаСервере(Текст)
	ОбщегоНазначения.СообщитьОбОшибке(Текст,,,СтатусСообщения.Важное);	
КонецПроцедуры


&НаСервере
Процедура ПолучитьПериодыОхоты(ПриСоздании = Ложь)
	мПериоды = ОхотаСервер.ПолучитьПериодыОхоты(Объект); 
	Если мПериоды.Пустой() И НЕ ПриСоздании Тогда
		Текст = "Не определены периоды охоты";
		Поле = "Объект";
		ОхотаСервер.ПоказатьСообщение(Текст,Поле);
		Возврат;
	Иначе
		Периоды = мПериоды.Выгрузить();
		СтруктураОтбора = Новый Структура("ВидДичи",Объект.ВидДичи);
		Строки = Периоды.НайтиСтроки(СтруктураОтбора);
		Если Строки.Количество() = 0 И НЕ ПриСоздании Тогда
			Текст = "Не определены периоды охоты";
			Поле = "Объект.ВидДичи";
			ОхотаСервер.ПоказатьСообщение(Текст,Поле);
			Возврат;
		КонецЕсли;	
	КонецЕсли;	
	
	Если НЕ ПриСоздании Тогда
		ТолькоСезонная = Истина;
		Для каждого стр из Периоды Цикл
			ТолькоСезонная = ТолькоСезонная И стр.ТолькоСезонная;
		КонецЦикла;		
		
		Элементы.ГруппаСезоннаяРазоваяПроизвольный.Видимость = НЕ ТолькоСезонная;
		Объект.Сезонная = ?(ТолькоСезонная,Истина,Объект.Сезонная);
		Объект.ПроизвольныйПериод = ?(ТолькоСезонная,Ложь,Объект.ПроизвольныйПериод);
	КонецЕсли;	
	
	ЗначениеВРеквизитФормы(Периоды,"ПериодыОхоты");
	
КонецПроцедуры

&НаСервере
Процедура ПодобратьПериодыОхоты()
	
	Периоды = РеквизитФормыВЗначение("ПериодыОхоты");
	
	Если Периоды.Количество() = 0 Тогда
		Текст = "Для данного вида дичи не определены периоды охоты";
		Поле = "Объект.ВидДичи";
		ПоказатьСообщениеНаСервере(Текст,Поле);
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВрТаб.ВидДичи,
	|	ВрТаб.ДатаНачала,
	|	ВрТаб.ДатаОкончания,
	|	ВрТаб.ТолькоСезонная,
	|	ВрТаб.РазоваяДатаНачала,
	|	ВрТаб.РазоваяДатаОкончания,
	|	&Сезонная
	|ПОМЕСТИТЬ Периоды
	|ИЗ
	|	&ВрТаб КАК ВрТаб
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Периоды.ВидДичи,
	|	ВЫБОР
	|		КОГДА Периоды.Сезонная
	|			ТОГДА Периоды.ДатаНачала
	|		ИНАЧЕ Периоды.РазоваяДатаНачала
	|	КОНЕЦ КАК ДатаНачала,
	|	ВЫБОР
	|		КОГДА Периоды.Сезонная
	|			ТОГДА Периоды.ДатаОкончания
	|		ИНАЧЕ Периоды.РазоваяДатаОкончания
	|	КОНЕЦ КАК ДатаОкончания
	|ИЗ
	|	Периоды КАК Периоды
	|ГДЕ
	|	ВЫБОР
	|			КОГДА Периоды.Сезонная
	|				ТОГДА НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ) <= КОНЕЦПЕРИОДА(Периоды.ДатаОкончания, ДЕНЬ)
	|			ИНАЧЕ НАЧАЛОПЕРИОДА(Периоды.РазоваяДатаНачала, ДЕНЬ) >= НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ)
	|		КОНЕЦ";
	
	
	Запрос.УстановитьПараметр("ВрТаб",Периоды);
	Запрос.УстановитьПараметр("Сезонная",Объект.Сезонная);
	Запрос.УстановитьПараметр("Дата",?(Объект.Дата = '00010101',ТекущаяДата(),Объект.Дата));
	Результат = Запрос.Выполнить();
	
	Выборка =  Результат.Выбрать();
	
	МассивПериодов = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		МассивПериодов.Добавить("с " + Формат(Выборка.ДатаНачала, "ДФ ='дд.ММ.гггг '") + " по " +  Формат(Выборка.ДатаОкончания, "ДФ ='дд.ММ.гггг'"));
	КонецЦикла;	
	
	Элементы.ПериодОхоты.СписокВыбора.ЗагрузитьЗначения(МассивПериодов);		
	
	Если ПериодыОхоты = "" Тогда
		ПериодыОхоты = ("с " + Формат(Объект.ДатаНачала, "ДФ ='дд.ММ.гггг '") + " по " +  Формат(Объект.ДатаОкончания, "ДФ ='дд.ММ.гггг'"));
	КонецЕсли;	
	//Элементы.ПериодОхоты.СписокВыбора.ЗагрузитьЗначения(мПериоды.ВыгрузитьКолонку("Имя"));
КонецПроцедуры

////////////////////

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПроизвольныйПериодПриИзменении(Неопределено);

	Если НЕ ЗначениеЗаполнено(Объект.ВидДичи) Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ДатаНачала) И ЗначениеЗаполнено(Объект.ДатаОкончания) Тогда
		ПериодОхоты = ("с " + Формат(Объект.ДатаНачала, "ДФ ='дд.ММ.гггг'") + " по " +  Формат(Объект.ДатаОкончания, "ДФ ='дд.ММ.гггг'"));
		Элементы.ПериодОхоты.СписокВыбора.Добавить(ПериодОхоты,ПериодОхоты);
	КонецЕсли;
	
	СформироватьСтрокуПутевки();
	
	УстановитьДоступностьЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьЭлементов()
	Если НЕ Объект.СезонОхоты.Пустая() Тогда
		Элементы.СезонОхоты.ТолькоПросмотр = Истина;
	КонецЕсли;	
	
	
	Если НЕ Объект.Ответственный.Пустая() Тогда
		Элементы.Ответственный.ТолькоПросмотр = Истина;
	КонецЕсли;	
	
	Если НЕ Объект.Охотхозяйство.Пустая() Тогда
		Элементы.Охотхозяйство.ТолькоПросмотр = Истина;
	КонецЕсли;	

	Элементы.Группа1.ТолькоПросмотр = Объект.Обработан;
	//Элементы.Группа10.Видимость = НЕ Объект.Обработан;
	Элементы.ДекорацияРаспечатан.Видимость = Объект.Обработан;
	
	Для каждого элемент из Элементы.СтраницаОбщиеДанные.ПодчиненныеЭлементы Цикл
		УстановитьДоступность(элемент);	
	КонецЦикла;
	
	Элементы.Путевка_договор.Доступность = Истина;
	Элементы.СоздатьПутевку.Доступность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступность(Элемент)
	Если ТипЗнч(элемент) = Тип("ГруппаФормы") И Элемент.ПодчиненныеЭлементы.Количество() > 0 Тогда
		Для каждого эл из Элемент.ПодчиненныеЭлементы Цикл
			УстановитьДоступность(эл);
		КонецЦикла;
	ИначеЕсли ТипЗнч(элемент) = Тип("ПолеФормы") Тогда	
		
		Если элемент.Имя <> "Путевка_договор" ИЛИ элемент.Имя <> "СоздатьПутевку" Тогда
			элемент.ТолькоПросмотр = Объект.Обработан;
			Если элемент.Вид = ВидПоляФормы.ПолеВвода Тогда
				элемент.КнопкаОткрытия = Ложь;
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры	


&НаКлиенте
Процедура ОхотхозяйствоПриИзменении(Элемент)
	Если Объект.МестоОхоты.Пустая() Тогда
		Объект.МестоОхоты = Объект.Охотхозяйство;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Функция ПроверитьВозможностьПечати(ИмяМакета)
	
	Если Объект.БезПроверки Тогда
		ОбязательныеПоля = ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОбязательныхРеквизитовРазрешения();
		Для каждого КлючИЗначение из ОбязательныеПоля Цикл
			Если КлючИЗначение.Значение Тогда
				Если НЕ ЗначениеЗаполнено(Объект[КлючИЗначение.Ключ]) Тогда
					Текст = "Не заполнены обязательные поля. Печать невозможна.";
					Поле = "Объект";
					ПоказатьСообщениеНаСервере(Текст,Поле);
					
					Возврат Ложь;

				КонецЕсли;
			КонецЕсли;
		КонецЦикла;	
		
	Иначе	
	
		Если Объект.Охотхозяйство.Пустая() 
			ИЛИ	Объект.СезонОхоты.Пустая()
			ИЛИ Объект.Охотник.Пустая()
			ИЛИ Объект.МестоОхоты.Пустая()
			ИЛИ Объект.ВидДичи.Пустая()
			ИЛИ Объект.ДатаНачала = '00010101'
			ИЛИ Объект.ДатаОкончания = '00010101'
			ИЛИ ПустаяСтрока(СокрЛП(Объект.СерияРазрешения))
			ИЛИ ПустаяСтрока(СокрЛП(Объект.НомерРазрешения)) Тогда
			
			Текст = "Не заполнены обязательные поля. Печать невозможна.";
			Поле = "Объект";
			ПоказатьСообщениеНаСервере(Текст,Поле);
			
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;	
	
	Если НЕ Объект.Проведен Тогда
		Описание = Новый ОписаниеОповещения("ПроверкаВозможностиПечатиЗавершение",ЭтаФорма,ИмяМакета);
		ПоказатьВопрос(Описание,"Документ не проведен.Для печати его необходимо провести.
		|Провести документ?",РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Да);
		
		Возврат Ложь;					
	КонецЕсли;
	
	Если Модифицированность Тогда
		Описание = Новый ОписаниеОповещения("ПроверкаВозможностиПечатиЗавершение",ЭтаФорма,ИмяМакета);
		ПоказатьВопрос(Описание,"Документ изменен. Для печати его необходимо провести.
		|Провести документ?",РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Да);
		
		Возврат Ложь;					
	КонецЕсли;
	
	Возврат Истина;
	
	

КонецФункции

&НаКлиенте
Процедура ПроверкаПроведенияИМодифицированности(Путевка)
	Если НЕ Объект.Проведен Тогда
		ТекстВопроса = "Документ не проведен. Сначала следует провести документ.
		|Провести документ?";
		ПоказатьВопросНаФорме(ТекстВопроса,Путевка);					
		
		Возврат;
	ИначеЕсли Модифицированность  Тогда
		
		ТекстВопроса = "Документ был изменен. Документ следует перепровести.
		|Провести документ?";
		ПоказатьВопросНаФорме(ТекстВопроса,Путевка);					
		Возврат;		
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ПроверкаВозможностиПечатиЗавершение(РезультатВопроса,ИмяМакета) Экспорт
	Если РезультатВопроса = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		ПараметрыЗаписи = Новый Структура;
		ПараметрыЗаписи.Вставить("РежимЗаписи",РежимЗаписиДокумента.Проведение);
		ЭтаФорма.Записать(ПараметрыЗаписи);
		
	Исключение
		ТекстОшибки = СформироватьТекстСообщенияНаСервере(ОписаниеОшибки());	
		
		Поле = "Объект";
		ПоказатьСообщениеНаСервере(ТекстОшибки,Поле);
		
		СформироватьЗаписьЖурналаНаСервере(ТекстОшибки);
		Возврат;
	КонецПопытки;
	
	ОткрытьФормуПечати(ИмяМакета);
	
КонецПроцедуры	

&НаСервереБезКонтекста
Функция СформироватьТекстСообщенияНаСервере(ОписаниеОшибки)
	Возврат ОбщегоНазначения.СформироватьТекстСообщения(ОписаниеОшибки);	
КонецФункции	

&НаСервере
Процедура СформироватьЗаписьЖурналаНаСервере(ТекстОшибки)
	ОбщегоНазначения.СформироватьЗаписьЖурналаРегистрации("Данные.Проведение",УровеньЖурналаРегистрации.Ошибка,Объект.Ссылка.Метаданные(),Объект.Ссылка,ТекстОшибки);		
КонецПроцедуры

&НаКлиенте
Процедура Печать(Команда)
	ИмяМакета = Команда.Имя;
	Если НЕ ПроверитьВозможностьПечати(ИмяМакета) Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытьФормуПечати(ИмяМакета);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуПечати(ИмяМакета)
	ПараметрыПечати = Новый Структура;
	ПараметрыПечати.Вставить("ИмяМакета",ИмяМакета);
	ПараметрыПечати.Вставить("Документ",Объект.Ссылка);
	ОткрытьФорму("ОбщаяФорма.ФормаПечати",ПараметрыПечати,ЭтаФорма,УникальныйИдентификатор);
КонецПроцедуры

&НаКлиенте
Процедура СформироватьСтрокуПутевки() Экспорт
	Элементы.СоздатьПутевку.Заголовок = СформироватьСтрокуПутевкиНаСервере(Объект.ПутевкаДоговор); 
КонецПроцедуры

&НаСервереБезКонтекста
Функция СформироватьСтрокуПутевкиНаСервере(Ссылка)
	Возврат ОхотаСервер.ПолучитьТекстПутевки(Ссылка)
КонецФункции

&НаСервере
Процедура ОбновитьДанныеВПодчиненномДокументе(Отказ = Ложь,Путевка)
	Равны = РавныОбъекты(Объект.Ссылка,Путевка);
	Если Не Равны Тогда
		Если НЕ Путевка.Пустая() Тогда
			ОбъектПутевка = Путевка.ПолучитьОбъект();
		Иначе 
			Возврат;
		КонецЕсли;	
		
		ОбъектПутевка.Заполнить(Объект.Ссылка);
		
		
		Попытка
			ОбъектПутевка.Записать();
			Путевка = ОбъектПутевка.Ссылка;
			Объект.ПутевкаДоговор = Путевка;
			Записать();
		Исключение
			Отказ = Истина;
			ТекстОшибки = ОбщегоНазначения.СформироватьТекстСообщения(ОписаниеОшибки());	
			ОбщегоНазначения.СформироватьЗаписьЖурналаРегистрации("Данные.Проведение",УровеньЖурналаРегистрации.Ошибка,Объект.Ссылка.Метаданные(),Объект.Ссылка,ТекстОшибки);		
			
		КонецПопытки;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	ПередЗакрытиемНаСервере(Отказ);
	Если НЕ Объект.Обработан И НЕ БылЗаданВопрос Тогда
		Отказ = Истина;
		БылЗаданВопрос = Истина;
		Оповещение = Новый ОписаниеОповещения("ПриЗакрытииЗавершение",ЭтаФорма,Отказ);
	
		ПоказатьВопрос(Оповещение,"Документ не распечатан. Закрыть?",РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Да,"Обработка документа");
	КонецЕсли;	
КонецПроцедуры


&НаКлиенте
Процедура ПриЗакрытииЗавершение(Результат,Отказ) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
		Закрыть();
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ПередЗакрытиемНаСервере(Отказ)
	Путевка = Объект.ПутевкаДоговор;
	Если НЕ Путевка.Пустая() Тогда
		ОбновитьДанныеВПодчиненномДокументе(Отказ,Путевка);
	КонецЕсли;
КонецПроцедуры


&НаСервере
Функция РавныОбъекты(Разрешение,Путевка)
	
	СтруктураСравнения = Новый Структура
	("Дата,
	|СезонОхоты,
	|Охотхозяйство,
	|МестоОхоты,
	|Охотник,
	|ДатаНачала,
	|ДатаОкончания,
	|ВидДичи,
	|СерияРазрешения,
	|Сезонная,
	|НомерРазрешения,
	|Комментарий");
	
	//РеквизитыРазрешиния = Разрешение.Метаданные().Реквизиты;
	
	//ЗаполнитьЗначенияСвойств(СтруктураСравнения,Путевка);
	
	Для каждого КлючИЗначение из СтруктураСравнения Цикл
		Если Путевка[КлючИЗначение.Ключ] = Разрешение[КлючИЗначение.Ключ] Тогда
			Продолжить;
		Иначе
			Возврат Ложь;	
		КонецЕсли;
	КонецЦикла;
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Если ВладелецФормы <> Неопределено Тогда
		Если ТипЗнч(ВладелецФормы) = Тип("УправляемаяФорма") И СтрНайти(ВладелецФормы.ИмяФормы,"Список") <> 0 Тогда
			Если ВладелецФормы.ТекущаяСтрока <> Объект.Ссылка Тогда
				ВладелецФормы.ТекущаяСтрока = Объект.Ссылка;
			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;	
	
	Путевка = ПолучитьПутевку(Объект.Ссылка);
	Если Путевка.Пустая() Тогда
		Возврат;
	КонецЕсли;	
	Прочитать();
	ОбновитьДанныеВПодчиненномДокументе(,Путевка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "СформироватьСтрокуПутевки" 
		И Источник.ВладелецФормы = ЭтаФорма Тогда
		Объект.ПутевкаДоговор = Параметр;
		СформироватьСтрокуПутевки();
	ИначеЕсли ИмяСобытия = "ИзменениеДанныхОхотника" Тогда
		Объект.Охотник = Параметр;		
	ИначеЕсли ИмяСобытия = "Документ распечатан" Тогда
		Если Источник = "Разрешение" Тогда
			Если Параметр = "ЛицеваяСторона" Тогда
				РаспечатанаЛицеваяСторона  = Истина;
			ИначеЕсли Параметр = "ОбратнаяСторона" Тогда
				РаспечатанаОбратнаяСторона = Истина;
			КонецЕсли;
			Обработан = РаспечатанаЛицеваяСторона И РаспечатанаОбратнаяСторона;
			Если Объект.Обработан <> Обработан Тогда
				Объект.Обработан = Обработан;
				Записать();
			КонецЕсли;	
			УстановитьДоступностьЭлементов();
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидДичиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Если НЕ Объект.ВидДичи.Пустая() Тогда
		ПредыдущийВидДичи = Объект.ВидДичи;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.МестоОхоты) Тогда
		Текст = "Необходимо заполнить место охоты";
		Поле = "Объект.МестоОхоты";
		ПоказатьСообщениеНаСервере(Текст,Поле);
		Возврат;
	КонецЕсли;
	
	ДанныеВыбора = ПолучитьСписокВыбораВидаДичи();
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокВыбораВидаДичи()
	
	
КонецФункции

&НаСервереБезКонтекста
Процедура ПоказатьСообщениеНаСервере(Текст,Поле)
	ОхотаСервер.ПоказатьСообщение(Текст,Поле);	
КонецПроцедуры

&НаКлиенте
Процедура ВидДичиПриИзменении(Элемент)
	Элементы.ПериодОхоты.СписокВыбора.Очистить();
	СписокДичи = ПолучитьСписокДичи(Объект.ВидДичи);
	Если Объект.ВидДичи = ПредыдущийВидДичи Тогда
		Возврат;
	Иначе	
		Объект.ДатаНачала = '00010101';
		Объект.ДатаОкончания = '00010101';
	КонецЕсли;
	
	
	
	

КонецПроцедуры

&НаКлиенте
Процедура ПериодОхотыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Если Объект.ВидДичи.Пустая() Тогда
		Текст = "Не заполнен вид дичи.
		|Невозможно подобрать актуальные периоды охоты!";
		Поле = "Объект.ВидДичи";
		ПоказатьСообщениеНаСервере(Текст,Поле);
		Возврат;
	КонецЕсли;	
	
	ПодобратьПериодыОхоты();	
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодОхотыПриИзменении(Элемент)
	
	ТекстДатаНачала = Сред(ПериодОхоты,3,10);
	ТекстДатаОкончания = Прав(ПериодОхоты,10);
	
	ДатаНачала = Дата(Прав(ТекстДатаНачала,4) + Сред(ТекстДатаНачала,4,2) + Лев(ТекстДатаНачала,2));
	ДатаОкончания = Дата(Прав(ТекстДатаОкончания,4) + Сред(ТекстДатаОкончания,4,2) + Лев(ТекстДатаОкончания,2));
	
	Объект.ДатаНачала = ДатаНачала;
	Объект.ДатаОкончания = ДатаОкончания;
	
КонецПроцедуры

&НаКлиенте
Процедура СезоннаяПриИзменении(Элемент)
	Объект.ДатаНачала = '00010101';
	Объект.ДатаОкончания = '00010101';
	
	ПериодОхоты = "";
	Элементы.ПериодОхоты.СписокВыбора.Очистить();
КонецПроцедуры

&НаКлиенте
Процедура ОхотникОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ДанныеОхотника = ПолучитьДанныеОбОхотникеНаСервере(ВыбранноеЗначение);
	Если НЕ ДанныеОхотника.ЕстьГосБилет Тогда
		Описание = Новый ОписаниеОповещения("ОхотникОбработкаВыбораЗавершение",ЭтаФорма,ВыбранноеЗначение);
		ТекстВопроса = "Охотник не имеет действующего гос билета.
		|Хотите внести данные?";
		ПоказатьВопрос(Описание,ТекстВопроса,РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Да);
		Возврат;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ОхотникОбработкаВыбораЗавершение(РезультатВопроса,Охотник) Экспорт
	Если РезультатВопроса = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("Ключ",Охотник);
	ОткрытьФорму("Справочник.Охотники.Форма.ФормаЭлемента",ПараметрыФормы,ЭтаФорма,УникальныйИдентификатор);
	
КонецПроцедуры


&НаСервереБезКонтекста
Функция ПолучитьДанныеОбОхотникеНаСервере(Охотник)
	Возврат ОхотаСерверПовтИсп.ПолучитьДанныеОхотника(Охотник);	
КонецФункции

&НаКлиенте
Процедура ДобытаяДичьПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)

	Элементы.ДобытаяДичьДичь.СписокВыбора.Очистить();
	Если СписокДичи.Количество() > 0 Тогда
		Для каждого эл из СписокДичи Цикл
			Элементы.ДобытаяДичьДичь.СписокВыбора.Добавить(эл.Значение,эл.Представление);
		КонецЦикла;	
	КонецЕсли;	
	
	КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСписокДичи(ВидДичи)
	
	Если ВидДичи.Пустая() Тогда
		Возврат Новый СписокЗначений;
	Иначе
		Возврат ОхотаСерверПовтИсп.ПолучитьСписокДичи(ВидДичи,Ложь);	
	КонецЕсли;	
КонецФункции	

&НаКлиенте
Процедура ДобытаяДичьДичьОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если СписокДичи.НайтиПоЗначению(ВыбранноеЗначение) = Неопределено Тогда
		СтандартнаяОбработка = Ложь;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Выбранная дичь не относится к виду дичи, указанному в документе.");
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПроизвольныйПериодПриИзменении(Элемент)
	Элементы.ГруппаПроизвольныйПериод.Видимость = Объект.ПроизвольныйПериод;
	Элементы.ПериодОхоты.Видимость = НЕ Объект.ПроизвольныйПериод;
КонецПроцедуры

&НаКлиенте
Процедура ДатаНачалаПриИзменении(Элемент)
	Если Объект.ДатаНачала = '00010101' Тогда
		Возврат;
	КонецЕсли;	
	
	ОшибкиПериода = ПолучитьПроизвольныеПериодыОхоты(Объект.ВидДичи,Объект.СезонОхоты,Объект.ДатаНачала,Объект.ДатаОкончания,Объект.Дата,Элемент.Имя);
	
	Если ОшибкиПериода.Отказ Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОшибкиПериода.ТекстОшибки);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаОкончанияПриИзменении(Элемент)
	Если Объект.ДатаОкончания = '00010101' Тогда
		Возврат;
	КонецЕсли;
	ОшибкиПериода = ПолучитьПроизвольныеПериодыОхоты(Объект.ВидДичи,Объект.СезонОхоты,Объект.ДатаНачала,Объект.ДатаОкончания,Объект.Дата,Элемент.Имя);
	Если ОшибкиПериода.Отказ Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОшибкиПериода.ТекстОшибки);		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПроизвольныеПериодыОхоты(ВидДичи,СезонОхоты,ДатаНачала,ДатаОкончания,ДатаСреза,Элемент)
	СтруктураОтвета = Новый Структура;
	СтруктураОтвета.Вставить("Отказ",Ложь);
		
	Если ВидДичи.Пустая() Тогда
		СтруктураОтвета.Вставить("Отказ",Истина);
		СтруктураОтвета.Вставить("ТекстОшибки","Не заполнен вид дичи");
		Возврат СтруктураОтвета;
	КонецЕсли;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МИНИМУМ(ЦеныПоВидамДичи.ДатаНачала) КАК ДатаНачала,
		|	МАКСИМУМ(ЦеныПоВидамДичи.ДатаОкончания) КАК ДатаОкончания
		|ИЗ
		|	РегистрСведений.ЦеныПоВидамДичи.СрезПоследних(
		|			&ДатаСреза,
		|			ВидДичи = &ВидДичи
		|				И СезонОхоты = &СезонОхоты) КАК ЦеныПоВидамДичи
		|
		|ИМЕЮЩИЕ
		|	НЕ МИНИМУМ(ЦеныПоВидамДичи.ДатаНачала) ЕСТЬ NULL  И
		|	НЕ МАКСИМУМ(ЦеныПоВидамДичи.ДатаОкончания) ЕСТЬ NULL ";
	
	Запрос.УстановитьПараметр("ВидДичи", ВидДичи);
	Запрос.УстановитьПараметр("ДатаСреза", ДатаСреза);
	Запрос.УстановитьПараметр("СезонОхоты", СезонОхоты);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		СтруктураОтвета.Вставить("Отказ",Истина);
		СтруктураОтвета.Вставить("ТекстОшибки","Не определены периоды охоты");
		ДатаНачала = '00010101';
		ДатаОкончания = '00010101';
		Возврат СтруктураОтвета;
	КонецЕсли;	
	Выборка = Результат.Выбрать();
	Выборка.Следующий();	
	
	Если ДатаНачала <> '00010101' И ДатаНачала < Выборка.ДатаНачала Тогда
		СтруктураОтвета.Вставить("Отказ",Истина);
		СтруктураОтвета.Вставить("ТекстОшибки",("Дата начала периода охоты не может быть ранее " + Формат(Выборка.ДатаНачала,"ДФ=dd.MM.yyyy")));
		ДатаНачала = Выборка.ДатаНачала;
		Возврат СтруктураОтвета;
	ИначеЕсли ДатаНачала > Выборка.ДатаОкончания Тогда
		СтруктураОтвета.Вставить("Отказ",Истина);
		СтруктураОтвета.Вставить("ТекстОшибки",("Дата начала периода охоты не может быть позже " + Формат(Выборка.ДатаОкончания,"ДФ=dd.MM.yyyy")));
		ДатаНачала = Выборка.ДатаНачала;
		Возврат СтруктураОтвета;
	ИначеЕсли ДатаОкончания <> '00010101' И ДатаОкончания < Выборка.ДатаНачала Тогда
		СтруктураОтвета.Вставить("Отказ",Истина);
		СтруктураОтвета.Вставить("ТекстОшибки",("Дата окончания периода охоты не может быть ранее " + Формат(Выборка.ДатаНачала,"ДФ=dd.MM.yyyy")));
		ДатаОкончания = Выборка.ДатаОкончания;
		Возврат СтруктураОтвета;
	ИначеЕсли ДатаОкончания > Выборка.ДатаОкончания Тогда
		СтруктураОтвета.Вставить("Отказ",Истина);
		СтруктураОтвета.Вставить("ТекстОшибки",("Дата окончания периода охоты не может быть позже " + Формат(Выборка.ДатаОкончания,"ДФ=dd.MM.yyyy")));
		ДатаОкончания = Выборка.ДатаОкончания;
		Возврат СтруктураОтвета;
	ИначеЕсли ДатаНачала > ДатаОкончания И ДатаОкончания <> '00010101' Тогда
		Если Элемент = "ДатаНачала" Тогда
			СтруктураОтвета.Вставить("Отказ",Истина);
			СтруктураОтвета.Вставить("ТекстОшибки","Дата начала периода охоты не может быть позже даты окончания");
			ДатаНачала = '00010101';
			Возврат СтруктураОтвета;
		ИначеЕсли Элемент = "ДатаОкончания" Тогда
			СтруктураОтвета.Вставить("Отказ",Истина);
			СтруктураОтвета.Вставить("ТекстОшибки","Дата окончания периода охоты не может быть раньше даты начала");
			ДатаОкончания = '00010101';
			Возврат СтруктураОтвета;
		КонецЕсли;	
	КонецЕсли;
	
	Возврат СтруктураОтвета;
		
	
КонецФункции	

&НаКлиенте
Процедура ОбработанПриИзменении(Элемент)
	УстановитьДоступностьЭлементов();
	Если НЕ Объект.Ссылка.Пустая() И НЕ Объект.Обработан Тогда
		ЭтаФорма.Записать(Новый Структура("РежимЗаписи",РежимЗаписиДокумента.ОтменаПроведения));
	КонецЕсли;
	РаспечатанаЛицеваяСторона = Объект.Обработан;
	РаспечатанаОбратнаяСторона = Объект.Обработан;
КонецПроцедуры

&НаКлиенте
Процедура СданПриИзменении(Элемент)
	//Если Объект.Сдан И Объект.ДобытаяДичь.Количество() = 0 Тогда
	//	Объект.Сдан = Ложь;
	//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Занесите добытую дичь.");
	//КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОхотникНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ОхотникАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	Если СтрДлина(Текст) < 2 Тогда
		СтандартнаяОбработка = Ложь;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПериодОхотыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	А=0;
КонецПроцедуры

&НаКлиенте
Процедура ВидДичиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Объект.ВидДичи = ВыбранноеЗначение;
	ПолучитьПериодыОхоты();	
	ПроизвольныйПериодПриИзменении(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
Если Объект.АктМПР и Объект.Сдан тогда
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка при записи. Флажки АктМПР и Сдан установлены одновременно. ");
	Отказ= Истина;
КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДату(Команда)
	Стр = Элементы.ДобытаяДичь.ТекущиеДанные;
	Если НЕ ЗначениеЗаполнено(Стр.ДатаДобычи) тогда
		Для каждого Стр из Объект.ДобытаяДичь Цикл
			Стр.ДатаДобычи= ТекущаяДата();
		КонецЦикла;	
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЗаявлениеНажатие(Элемент)
	Заявление = Объект.Заявление;
	
	Если (Объект.ПометкаУдаления) И Не ЗначениеЗаполнено(Заявление) Тогда
		ПоказатьПредупреждение(,"Путевку нельзя вводить на основании документа, помеченного на удаление",60);
		Возврат;
	КонецЕсли;
	
	ОткрытьФормуЗаявление(Заявление);

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуЗаявление(Заявление)
	
	Если НЕ Объект.Проведен ИЛИ Модифицированность Тогда
		ПроверкаПроведенияИМодифицированности(Заявление);
		Возврат;
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(Заявление) Тогда
		ПараметрыФормы = Новый Структура("Ключ",Заявление);
	Иначе
		ПараметрыФормы = Новый Структура("Основание",Объект.Ссылка);
	КонецЕсли;
	
	Если  ТипЗнч(ВладелецФормы) = Тип("УправляемаяФорма") Тогда
		Если СтрНайти(ВладелецФормы.ИмяФормы,"Документ.Заявление") <> 0 Тогда
			Если ВладелецФормы.Объект.Ссылка = Заявление Тогда
				ВладелецФормы.Активизировать();
			КонецЕсли;	
		Иначе
			ОткрытьФорму("Документ.Заявление.ФормаОбъекта", ПараметрыФормы,ЭтаФорма,УникальныйИдентификатор);	
		КонецЕсли;	
	Иначе
		ОткрытьФорму("Документ.Заявление.ФормаОбъекта", ПараметрыФормы,ЭтаФорма,УникальныйИдентификатор);
	КонецЕсли;
	
	
КонецПроцедуры


////////
